app/controllers/categories_controller.rb

  def create
    #@category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 12 Jan 2013 10:19:38 UTC +00:00], ["name", "First category"], ["updated_at", Sat, 12 Jan 2013 10:19:38 UTC +00:00]]