app/controllers/posts_controller.rb

  def index
    @posts = Post.order('id DESC')
    @posts = @posts.published if current_user.blank?
---
SELECT "posts".* FROM "posts" WHERE (publish_date <= '2013-01-12') ORDER BY id DESC
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 2 AND (publish_date <= '2013-01-12') ORDER BY id DESC

  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "excerpt", "publish_date", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "excerpt" = '<table id="table94856"><tbody><tr><td class="">1</td><td class="">jkasdasd</td><td class="">KLLLLLLLLLLLL</td></tr></tbody></table><p></p><p>Now here is my first excerpt!</p>